In [38]:
import numpy as np
import pandas as pd
import seaborn as sns

In [39]:
df=pd.read_csv("persona.csv")
df.head()

   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17

# GÖREV 1: Aşağıdaki soruları yanıtlayınız.

In [40]:
# Soru 1: persona.csv dosyasını okutunuz ve veri seti ile ilgili genel bilgileri gösteriniz.
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   PRICE    5000 non-null   int64
 1   SOURCE   5000 non-null   object
 2   SEX      5000 non-null   object
 3   COUNTRY  5000 non-null   object
 4   AGE      5000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 234.4+ KB

In [41]:
df.describe().T

        count     mean        std   min   25%   50%   75%   max
PRICE  5000.0  34.1320  12.464897   9.0  29.0  39.0  39.0  59.0
AGE    5000.0  23.5814   8.995908  15.0  17.0  21.0  27.0  66.0

In [42]:
kat_list=[column for column in df.columns if str(df[column].dtype)=="object"]
kat_list

['SOURCE', 'SEX', 'COUNTRY']

In [43]:
for item in kat_list:
    print(df[item].value_counts())
    print("****************")

android    2974
ios        2026
Name: SOURCE, dtype: int64
****************
female    2621
male      2379
Name: SEX, dtype: int64
****************
usa    2065
bra    1496
deu     455
tur     451
fra     303
can     230
Name: COUNTRY, dtype: int64
****************

In [44]:
# Soru 2: Kaç unique SOURCE vardır? Frekansları nedir?
# Soru 3: Kaç unique PRICE vardır?
for item in df.columns:
    print(item)
    print(df[item].unique())
    print(f"{item} frekans = {len(df[item].unique())}")
    print("******************")

PRICE
[39 49 29 19 59  9]
PRICE frekans = 6
******************
SOURCE
['android' 'ios']
SOURCE frekans = 2
******************
SEX
['male' 'female']
SEX frekans = 2
******************
COUNTRY
['bra' 'tur' 'usa' 'can' 'deu' 'fra']
COUNTRY frekans = 6
******************
AGE
[17 26 23 15 19 21 16 35 42 40 49 34 18 32 25 30 20 22 50 37 24 31 28 66
 27 47 57 52 39 59 46 36 29 51 55 53 33 43 38 56 54 41 44 45 65 61]
AGE frekans = 46
******************

In [45]:
# Soru 4: Hangi PRICE'dan kaçar tane satış gerçekleşmiş?
df["PRICE"].value_counts().sort_index()

9      200
19     992
29    1305
39    1260
49    1031
59     212
Name: PRICE, dtype: int64

In [46]:
# Soru 5: Hangi ülkeden kaçar tane satış olmuş?
df["COUNTRY"].value_counts(ascending=True)

can     230
fra     303
tur     451
deu     455
bra    1496
usa    2065
Name: COUNTRY, dtype: int64

In [47]:
# Soru 6: Ülkelere göre satışlardan toplam ne kadar kazanılmış?
df.groupby("COUNTRY")["PRICE"].agg(["sum"])

           sum
COUNTRY
bra      51354
can       7730
deu      15485
fra      10177
tur      15689
usa      70225

In [48]:
# Soru 7: SOURCE türlerine göre göre satış sayıları nedir?
df.groupby("SOURCE").agg({"PRICE":["sum","count"]})

          PRICE
            sum count
SOURCE
android  101636  2974
ios       69024  2026

In [49]:
# Soru 8: Ülkelere göre PRICE ortalamaları nedir?
df.groupby("COUNTRY").agg({"PRICE":["mean","sum","count"]})

             PRICE
              mean    sum count
COUNTRY
bra      34.327540  51354  1496
can      33.608696   7730   230
deu      34.032967  15485   455
fra      33.587459  10177   303
tur      34.787140  15689   451
usa      34.007264  70225  2065

In [50]:
# Soru 9: SOURCE'lara göre PRICE ortalamaları nedir?
df.groupby("SOURCE")["PRICE"].agg(["mean","sum","count"])

              mean     sum  count
SOURCE
android  34.174849  101636   2974
ios      34.069102   69024   2026

In [51]:
# Soru 10: COUNTRY-SOURCE kırılımında PRICE ortalamaları nedir?
df.groupby(["COUNTRY","SOURCE"])["PRICE"].agg(["mean","sum","count"])

                      mean    sum  count
COUNTRY SOURCE
bra     android  34.387029  32874    956
        ios      34.222222  18480    540
can     android  33.330709   4233    127
        ios      33.951456   3497    103
deu     android  33.869888   9111    269
        ios      34.268817   6374    186
fra     android  34.312500   5490    160
        ios      32.776224   4687    143
tur     android  36.229437   8369    231
        ios      33.272727   7320    220
usa     android  33.760357  41559   1231
        ios      34.371703  28666    834

# GÖREV 2: COUNTRY, SOURCE, SEX, AGE kırılımında ortalama kazançlar nedir?

In [52]:
df.groupby(["COUNTRY","SOURCE","SEX","AGE"])["PRICE"].agg(["mean"])

                                 mean
COUNTRY SOURCE  SEX    AGE
bra     android female 15   38.714286
                       16   35.944444
                       17   35.666667
                       18   32.255814
                       19   35.206897
...                               ...
usa     ios     male   42   30.250000
                       50   39.000000
                       53   34.000000
                       55   29.000000
                       59   46.500000

[348 rows x 1 columns]

# GÖREV 3: Çıktıyı PRICE'a göre sıralayınız.

### Önceki sorudaki çıktıyı daha iyi görebilmek için sort_values metodunu azalan olacak şekilde PRICE'a uygulayınız.
### Çıktıyı agg_df olarak kaydediniz.

In [53]:
agg_df=df.groupby(["COUNTRY","SOURCE","SEX","AGE"])["PRICE"].agg(["mean"])
agg_df.rename(columns={"mean":"PRICE"},inplace=True)
agg_df=agg_df.sort_values(by="PRICE",ascending=False)
agg_df.head()

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android male   46    59.0
usa     android male   36    59.0
fra     android female 24    59.0
usa     ios     male   32    54.0
deu     android female 36    49.0

# GÖREV 4: Indekste yer alan isimleri değişken ismine çeviriniz.
### Üçüncü sorunun çıktısında yer alan PRICE dışındaki tüm değişkenler index isimleridir.
### Bu isimleri değişken isimlerine çeviriniz.
### İpucu: reset_index()

In [54]:
agg_df=agg_df.reset_index()
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE
0     bra  android    male   46   59.0
1     usa  android    male   36   59.0
2     fra  android  female   24   59.0
3     usa      ios    male   32   54.0
4     deu  android  female   36   49.0

In [55]:
df.shape

(5000, 5)

In [56]:
agg_df.shape

(348, 5)

# GÖREV 5: AGE değişkenini kategorik değişkene çeviriniz ve agg_df'e ekleyiniz.
### Age sayısal değişkenini kategorik değişkene çeviriniz.
### Aralıkları ikna edici olacağını düşündüğünüz şekilde oluşturunuz.
### Örneğin: '0_18', '19_23', '24_30', '31_40', '41_70'

In [57]:
agg_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 348 entries, 0 to 347
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   COUNTRY  348 non-null    object
 1   SOURCE   348 non-null    object
 2   SEX      348 non-null    object
 3   AGE      348 non-null    int64
 4   PRICE    348 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 13.7+ KB

In [58]:
def ChangeCategory(x):
    if x<=18:
        return "0_18"
    elif ((x>18)&(x<=23)):
        return "19_23"
    elif ((x>23)&(x<=30)):
        return "24_30"
    elif ((x>30)&(x<=40)):
        return "31_40"
    elif ((x>40)&(x<=70)):
        return "41_70"



agg_df["AGE_Cat"]=agg_df["AGE"].apply(ChangeCategory)

In [59]:
agg_df["AGE_Cat"].value_counts()

24_30    78
0_18     77
19_23    71
31_40    65
41_70    57
Name: AGE_Cat, dtype: int64

In [60]:
agg_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 348 entries, 0 to 347
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   COUNTRY  348 non-null    object
 1   SOURCE   348 non-null    object
 2   SEX      348 non-null    object
 3   AGE      348 non-null    int64
 4   PRICE    348 non-null    float64
 5   AGE_Cat  348 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 16.4+ KB

In [61]:
agg_df["AGE_Cat"]=agg_df["AGE_Cat"].astype("category")
agg_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 348 entries, 0 to 347
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   COUNTRY  348 non-null    object
 1   SOURCE   348 non-null    object
 2   SEX      348 non-null    object
 3   AGE      348 non-null    int64
 4   PRICE    348 non-null    float64
 5   AGE_Cat  348 non-null    category
dtypes: category(1), float64(1), int64(1), object(3)
memory usage: 14.3+ KB

# GÖREV 6: Yeni level based müşterileri tanımlayınız ve veri setine değişken olarak ekleyiniz.

### customers_level_based adında bir değişken tanımlayınız ve veri setine bu değişkeni ekleyiniz.
### Dikkat!
### list comp ile customers_level_based değerleri oluşturulduktan sonra bu değerlerin tekilleştirilmesi gerekmektedir.
### Örneğin birden fazla şu ifadeden olabilir: USA_ANDROID_MALE_0_18
### Bunları groupby'a alıp price ortalamalarını almak gerekmektedir.

In [62]:
for col in agg_df.columns:
    if str(agg_df[col].dtype)=="category":
        agg_df[col]=agg_df[col].astype("object")

agg_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 348 entries, 0 to 347
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   COUNTRY  348 non-null    object
 1   SOURCE   348 non-null    object
 2   SEX      348 non-null    object
 3   AGE      348 non-null    int64
 4   PRICE    348 non-null    float64
 5   AGE_Cat  348 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 16.4+ KB

In [63]:
agg_df["customers_level_based"]=agg_df["COUNTRY"]+"_"+agg_df["SOURCE"]+"_"+agg_df["SEX"]+"_"+agg_df["AGE_Cat"]

agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE AGE_Cat     customers_level_based
0     bra  android    male   46   59.0   41_70    bra_android_male_41_70
1     usa  android    male   36   59.0   31_40    usa_android_male_31_40
2     fra  android  female   24   59.0   24_30  fra_android_female_24_30
3     usa      ios    male   32   54.0   31_40        usa_ios_male_31_40
4     deu  android  female   36   49.0   31_40  deu_android_female_31_40

In [64]:
for col in agg_df.columns:
    if str(agg_df[col].dtype)=="object":
        agg_df[col]=agg_df[col].astype("category")

In [65]:
agg_df=agg_df.groupby("customers_level_based")["PRICE"].agg(["mean"])

In [66]:
agg_df.head()

                               mean
customers_level_based
bra_android_female_0_18   35.645303
bra_android_female_19_23  34.077340
bra_android_female_24_30  33.863946
bra_android_female_31_40  34.898326
bra_android_female_41_70  36.737179

# GÖREV 7: Yeni müşterileri (USA_ANDROID_MALE_0_18) segmentlere ayırınız.

### PRICE'a göre segmentlere ayırınız,
### segmentleri "SEGMENT" isimlendirmesi ile agg_df'e ekleyiniz,
### segmentleri betimleyiniz,

In [67]:
agg_df.head()

                               mean
customers_level_based
bra_android_female_0_18   35.645303
bra_android_female_19_23  34.077340
bra_android_female_24_30  33.863946
bra_android_female_31_40  34.898326
bra_android_female_41_70  36.737179

In [68]:
agg_df["SEGMENT"]=pd.qcut(agg_df["mean"],4,labels=["D","C","B","A"])
agg_df.head()

                               mean SEGMENT
customers_level_based
bra_android_female_0_18   35.645303       B
bra_android_female_19_23  34.077340       C
bra_android_female_24_30  33.863946       C
bra_android_female_31_40  34.898326       B
bra_android_female_41_70  36.737179       A

In [69]:
agg_df.groupby("SEGMENT").agg({"mean":["min","max","mean","sum"]})

              mean
               min        max       mean          sum
SEGMENT
D        19.000000  32.333333  29.206780   817.789833
C        32.500000  34.077340  33.509674   904.761209
B        34.103727  36.000000  34.999645   944.990411
A        36.060606  45.428571  38.691234  1044.663328

# GÖREV 8: Yeni gelen müşterileri sınıflandırınız ne kadar gelir getirebileceğini tahmin ediniz.

### 33 yaşında ANDROID kullanan bir Türk kadını hangi segmente aittir ve ortalama ne kadar gelir kazandırması beklenir?


### 35 yaşında IOS kullanan bir Fransız kadını hangi segmente ve ortalama ne kadar gelir kazandırması beklenir?

In [70]:
agg_df.rename(columns={"mean":"PRICE"},inplace=True)
agg_df.head()

                              PRICE SEGMENT
customers_level_based
bra_android_female_0_18   35.645303       B
bra_android_female_19_23  34.077340       C
bra_android_female_24_30  33.863946       C
bra_android_female_31_40  34.898326       B
bra_android_female_41_70  36.737179       A

In [71]:
agg_df=agg_df.reset_index()
agg_df.head()

      customers_level_based      PRICE SEGMENT
0   bra_android_female_0_18  35.645303       B
1  bra_android_female_19_23  34.077340       C
2  bra_android_female_24_30  33.863946       C
3  bra_android_female_31_40  34.898326       B
4  bra_android_female_41_70  36.737179       A

In [72]:
newUser="tur_android_female_31_40"

agg_df[agg_df["customers_level_based"]==newUser.lower()]

       customers_level_based      PRICE SEGMENT
72  tur_android_female_31_40  41.833333       A

In [73]:
newUser1="FRA_ios_female_31_40"

agg_df[agg_df["customers_level_based"]==newUser1.lower() ]

   customers_level_based      PRICE SEGMENT
63  fra_ios_female_31_40  32.818182       C